Zimbo88/stm32-security-lab/tests/update_storage/test_update_storage.c
#include <stdint.h>
#include <stddef.h>
#include <stdio.h>
#include <string.h>

#include "boot_flash.h"
#include "boot_flash_target.h"
#include "boot_confirmation.h"
#include "boot_metadata.h"
#include "boot_slot.h"
#include "boot_slot_selection.h"
#include "monocypher-ed25519.h"
#include "simulated_flash.h"
#include "stm32f429_memory_layout.h"
#include "update_installer.h"
#include "update_package.h"

static int failures;

#define TEST_METADATA_BODY_SIZE 60U
#define TEST_METADATA_CRC_OFFSET 60U
#define TEST_METADATA_PADDING_OFFSET 64U
#define TEST_METADATA_COMMIT_OFFSET (STM32F429_BOOT_METADATA_RECORD_SIZE - 8U)
#define TEST_UPDATE_PAYLOAD_SIZE 256U
#define TEST_INSTALL_PROGRAM_CHUNK 128U
#define TEST_PACKAGE_BUFFER_SIZE \
    (STM32F429_SIGNED_IMAGE_HEADER_SIZE + TEST_UPDATE_PAYLOAD_SIZE + 32U)

static const boot_flash_region_t write_regions[] = {
    {STM32F429_BOOT_METADATA_A_BASE, STM32F429_BOOT_METADATA_A_END},
    {STM32F429_BOOT_METADATA_B_BASE, STM32F429_BOOT_METADATA_B_END},
    {STM32F429_UPDATE_METADATA_BASE, STM32F429_UPDATE_METADATA_END},
    {STM32F429_SLOT_B_SIGNED_IMAGE_BASE, STM32F429_SLOT_B_END},
};

static const boot_flash_region_t installer_write_regions[] = {
    {STM32F429_BOOT_METADATA_A_BASE, STM32F429_BOOT_METADATA_A_END},
    {STM32F429_BOOT_METADATA_B_BASE, STM32F429_BOOT_METADATA_B_END},
    {STM32F429_SLOT_A_SIGNED_IMAGE_BASE, STM32F429_SLOT_A_END},
    {STM32F429_SLOT_B_SIGNED_IMAGE_BASE, STM32F429_SLOT_B_END},
};

static uint8_t update_secret_key[64];
static uint8_t update_public_key[FIRMWARE_PUBLIC_KEY_SIZE];
static uint8_t protected_stage0_before[STM32F429_BOOTLOADER_SIZE];
static uint8_t protected_slot_before[STM32F429_SLOT_A_SIZE];
static uint8_t protected_recovery_before[STM32F429_RECOVERY_SIZE];

static void expect_status(
    const char *name,
    boot_flash_status_t expected,
    boot_flash_status_t actual
)
{
    if (actual != expected) {
        printf(
            "%s: expected %s (%d), got %s (%d)\n",
            name,
            boot_flash_status_text(expected),
            (int)expected,
            boot_flash_status_text(actual),
            (int)actual
        );
        failures += 1;
    }
}

static void expect_u32(const char *name, uint32_t expected, uint32_t actual)
{
    if (actual != expected) {
        printf(
            "%s: expected 0x%08lx, got 0x%08lx\n",
            name,
            (unsigned long)expected,
            (unsigned long)actual
        );
        failures += 1;
    }
}

static uint32_t test_crc32_update(uint32_t crc, const uint8_t *data, size_t length)
{
    crc = ~crc;
    for (size_t i = 0U; i < length; ++i) {
        crc ^= data[i];
        for (uint32_t bit = 0U; bit < 8U; ++bit) {
            const uint32_t mask = 0UL - (crc & 1UL);
            crc = (crc >> 1) ^ (0xEDB88320UL & mask);
        }
    }

    return ~crc;
}

static void test_store_le32(uint8_t out[4], uint32_t value)
{
    out[0] = (uint8_t)(value & 0xFFU);
    out[1] = (uint8_t)((value >> 8) & 0xFFU);
    out[2] = (uint8_t)((value >> 16) & 0xFFU);
    out[3] = (uint8_t)((value >> 24) & 0xFFU);
}

static void refresh_metadata_crc(uint8_t record[STM32F429_BOOT_METADATA_RECORD_SIZE])
{
    test_store_le32(
        &record[TEST_METADATA_CRC_OFFSET],
        test_crc32_update(0UL, record, TEST_METADATA_BODY_SIZE)
    );
}

static void expect_metadata_status(
    const char *name,
    boot_metadata_status_t expected,
    boot_metadata_status_t actual
)
{
    if (actual != expected) {
        printf(
            "%s: expected %s (%d), got %s (%d)\n",
            name,
            boot_metadata_status_text(expected),
            (int)expected,
            boot_metadata_status_text(actual),
            (int)actual
        );
        failures += 1;
    }
}

static void expect_package_status(
    const char *name,
    update_package_status_t expected,
    update_package_status_t actual
)
{
    if (actual != expected) {
        printf(
            "%s: expected %s (%d), got %s (%d)\n",
            name,
            update_package_status_text(expected),
            (int)expected,
            update_package_status_text(actual),
            (int)actual
        );
        failures += 1;
    }
}

static void expect_install_status(
    const char *name,
    update_install_status_t expected,
    update_install_status_t actual
)
{
    if (actual != expected) {
        printf(
            "%s: expected %s (%d), got %s (%d)\n",
            name,
            update_install_status_text(expected),
            (int)expected,
            update_install_status_text(actual),
            (int)actual
        );
        failures += 1;
    }
}

static void expect_selection_status(
    const char *name,
    boot_slot_selection_status_t expected,
    boot_slot_selection_status_t actual
)
{
    if (actual != expected) {
        printf(
            "%s: expected %s (%d), got %s (%d)\n",
            name,
            boot_slot_selection_status_text(expected),
            (int)expected,
            boot_slot_selection_status_text(actual),
            (int)actual
        );
        failures += 1;
    }
}

static void expect_confirm_status(
    const char *name,
    boot_confirm_status_t expected,
    boot_confirm_status_t actual
)
{
    if (actual != expected) {
        printf(
            "%s: expected %s (%d), got %s (%d)\n",
            name,
            boot_confirm_status_text(expected),
            (int)expected,
            boot_confirm_status_text(actual),
            (int)actual
        );
        failures += 1;
    }
}

static void expect_verify_status(
    const char *name,
    verify_status_t expected,
    verify_status_t actual
)
{
    if (actual != expected) {
        printf(
            "%s: expected %s (%d), got %s (%d)\n",
            name,
            signed_image_status_text(expected),
            (int)expected,
            signed_image_status_text(actual),
            (int)actual
        );
        failures += 1;
    }
}

static void expect_metadata_record(
    const char *name,
    const boot_metadata_record_t *record,
    uint32_t sequence,
    boot_metadata_state_t state,
    uint32_t active_slot,
    uint32_t candidate_slot,
    uint32_t version
)
{
    if (record == NULL) {
        printf("%s: null record\n", name);
        failures += 1;
        return;
    }

