Zimbo88/stm32-security-lab/tests/update_storage/test_update_storage.c
    expect_u32(name, sequence, record->sequence);
    if (record->state != state) {
        printf(
            "%s state: expected %s, got %s\n",
            name,
            boot_metadata_state_text(state),
            boot_metadata_state_text(record->state)
        );
        failures += 1;
    }
    expect_u32("active slot", active_slot, record->active_slot);
    expect_u32("candidate slot", candidate_slot, record->candidate_slot);
    expect_u32("candidate version", version, record->candidate_image_version);
}

static void make_flash(simulated_flash_t *sim, boot_flash_t *flash)
{
    simulated_flash_init(sim);
    expect_status(
        "flash init",
        BOOT_FLASH_OK,
        boot_flash_init(
            flash,
            sim,
            simulated_flash_ops(),
            write_regions,
            sizeof(write_regions) / sizeof(write_regions[0]),
            8U
        )
    );
}

static void make_installer_flash(simulated_flash_t *sim, boot_flash_t *flash)
{
    simulated_flash_init(sim);
    expect_status(
        "installer flash init",
        BOOT_FLASH_OK,
        boot_flash_init(
            flash,
            sim,
            simulated_flash_ops(),
            installer_write_regions,
            sizeof(installer_write_regions) / sizeof(installer_write_regions[0]),
            8U
        )
    );
}

static size_t flash_offset(uint32_t address)
{
    return (size_t)(address - STM32F429_FLASH_BASE);
}

static void fill_flash_region(
    simulated_flash_t *sim,
    uint32_t address,
    size_t length,
    uint8_t seed
)
{
    const size_t offset = flash_offset(address);

    for (size_t i = 0U; i < length; ++i) {
        sim->storage[offset + i] = (uint8_t)(seed + (uint8_t)i);
    }
}

static void snapshot_flash_region(
    const simulated_flash_t *sim,
    uint32_t address,
    uint8_t *snapshot,
    size_t length
)
{
    memcpy(snapshot, &sim->storage[flash_offset(address)], length);
}

static void expect_flash_region_unchanged(
    const char *name,
    const simulated_flash_t *sim,
    uint32_t address,
    const uint8_t *snapshot,
    size_t length
)
{
    if (memcmp(&sim->storage[flash_offset(address)], snapshot, length) != 0) {
        printf("%s changed unexpectedly\n", name);
        failures += 1;
    }
}

static void prepare_protected_snapshots(
    simulated_flash_t *sim,
    const boot_slot_descriptor_t *active
)
{
    fill_flash_region(
        sim,
        STM32F429_BOOTLOADER_BASE,
        STM32F429_BOOTLOADER_SIZE,
        0x10U
    );
    fill_flash_region(sim, active->signed_image_base, STM32F429_SLOT_A_SIZE, 0x40U);
    fill_flash_region(sim, STM32F429_RECOVERY_BASE, STM32F429_RECOVERY_SIZE, 0x80U);

    snapshot_flash_region(
        sim,
        STM32F429_BOOTLOADER_BASE,
        protected_stage0_before,
        sizeof(protected_stage0_before)
    );
    snapshot_flash_region(
        sim,
        active->signed_image_base,
        protected_slot_before,
        sizeof(protected_slot_before)
    );
    snapshot_flash_region(
        sim,
        STM32F429_RECOVERY_BASE,
        protected_recovery_before,
        sizeof(protected_recovery_before)
    );
}

static void expect_protected_regions_unchanged(
    const simulated_flash_t *sim,
    const boot_slot_descriptor_t *active
)
{
    expect_flash_region_unchanged(
        "Stage 0",
        sim,
        STM32F429_BOOTLOADER_BASE,
        protected_stage0_before,
        sizeof(protected_stage0_before)
    );
    expect_flash_region_unchanged(
        "active slot",
        sim,
        active->signed_image_base,
        protected_slot_before,
        sizeof(protected_slot_before)
    );
    expect_flash_region_unchanged(
        "recovery region",
        sim,
        STM32F429_RECOVERY_BASE,
        protected_recovery_before,
        sizeof(protected_recovery_before)
    );
}

static uint32_t count_writes_in_range(
    const simulated_flash_t *sim,
    uint32_t base,
    uint32_t end
)
{
    uint32_t count = 0U;

    for (size_t i = 0U; i < sim->write_log_count; ++i) {
        const simulated_flash_write_log_entry_t *entry = &sim->write_log[i];
        const uint32_t entry_end =
            entry->address + (uint32_t)entry->length;
        if ((entry->address < end) && (entry_end > base)) {
            count += 1U;
        }
    }

    return count;
}

static void test_sector_lookup_and_bounds(void)
{
    boot_flash_sector_t sector;
    simulated_flash_t sim;
    boot_flash_t flash;
    uint32_t base = 0U;
    uint32_t end = 0U;

    make_flash(&sim, &flash);
    expect_status("bounds", BOOT_FLASH_OK, boot_flash_bounds(&flash, &base, &end));
    expect_u32("flash base", STM32F429_FLASH_BASE, base);
    expect_u32("flash end", STM32F429_FLASH_END, end);

    expect_status("sector 0", BOOT_FLASH_OK, boot_flash_sector_by_id(0U, &sector));
    expect_u32("sector 0 base", 0x08000000UL, sector.base);
    expect_u32("sector 0 end", 0x08004000UL, sector.end);

    expect_status("sector 5", BOOT_FLASH_OK, boot_flash_sector_by_id(5U, &sector));
    expect_u32("sector 5 base", STM32F429_SLOT_A_SIGNED_IMAGE_BASE, sector.base);
    expect_u32("sector 5 size", 0x00020000UL, sector.size);

    expect_status("sector 12", BOOT_FLASH_OK, boot_flash_sector_by_id(12U, &sector));
    expect_u32("sector 12 base", STM32F429_SLOT_B_SIGNED_IMAGE_BASE, sector.base);
    expect_u32("sector 12 size", 0x00004000UL, sector.size);

    expect_status("sector 23", BOOT_FLASH_OK, boot_flash_sector_by_id(23U, &sector));
    expect_u32("sector 23 base", STM32F429_RECOVERY_BASE, sector.base);
    expect_u32("sector 23 end", STM32F429_FLASH_END, sector.end);

    expect_status(
        "invalid sector",
        BOOT_FLASH_ERR_INVALID_ARGUMENT,
        boot_flash_sector_by_id(24U, &sector)
    );
}

static void test_allowed_erase_policy(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;

    make_flash(&sim, &flash);

    expect_status(
        "erase metadata A",
        BOOT_FLASH_OK,
        boot_flash_erase_sector(&flash, STM32F429_BOOT_METADATA_A_FIRST_SECTOR)
    );
    expect_status(
        "erase update metadata",
        BOOT_FLASH_OK,
        boot_flash_erase_sector(&flash, STM32F429_UPDATE_METADATA_FIRST_SECTOR)
    );
    expect_status(
        "erase inactive slot",
        BOOT_FLASH_OK,
        boot_flash_erase_sector(&flash, STM32F429_SLOT_B_FIRST_SECTOR)
    );
    expect_status(
        "erase stage0 rejected",
        BOOT_FLASH_ERR_PROTECTED_REGION,
        boot_flash_erase_sector(&flash, STM32F429_BOOTLOADER_FIRST_SECTOR)
    );
    expect_status(
        "erase active slot rejected",
        BOOT_FLASH_ERR_PROTECTED_REGION,
        boot_flash_erase_sector(&flash, STM32F429_SLOT_A_FIRST_SECTOR)
    );
    expect_status(
        "erase recovery rejected",
        BOOT_FLASH_ERR_PROTECTED_REGION,
        boot_flash_erase_sector(&flash, STM32F429_RECOVERY_FIRST_SECTOR)
    );
    expect_u32("only allowed erases reached backend", 3U, sim.erase_count);
    expect_u32("last erase was inactive slot", STM32F429_SLOT_B_FIRST_SECTOR, sim.last_erase_sector);
}

static void test_target_flash_stub_fails_closed(void)
{
    boot_flash_t flash;
    uint8_t data[8] = {0U};
    uint8_t output[8];

    expect_status(
        "target stub init",
        BOOT_FLASH_OK,
        boot_flash_target_init_disabled(&flash)
    );
    expect_status(
        "target stub read disabled",
        BOOT_FLASH_ERR_BACKEND,
        boot_flash_read(&flash, STM32F429_FLASH_BASE, output, sizeof(output))
    );
    expect_status(
        "target stub erase protected",
        BOOT_FLASH_ERR_PROTECTED_REGION,
        boot_flash_erase_sector(&flash, STM32F429_BOOT_METADATA_A_FIRST_SECTOR)
    );
    expect_status(
        "target stub program protected",
        BOOT_FLASH_ERR_PROTECTED_REGION,
        boot_flash_program_aligned(&flash, STM32F429_BOOT_METADATA_A_BASE, data, sizeof(data))
    );
}

