Zimbo88/stm32-security-lab/tests/update_storage/test_update_storage.c
static void test_program_alignment_bounds_and_readback(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    uint8_t data[16];
    uint8_t erased_bytes[16];
    uint8_t readback[16];

    for (size_t i = 0U; i < sizeof(data); ++i) {
        data[i] = (uint8_t)(0xA0U + i);
        erased_bytes[i] = 0xFFU;
    }

    make_flash(&sim, &flash);

    expect_status(
        "program unaligned address",
        BOOT_FLASH_ERR_ALIGNMENT,
        boot_flash_program_aligned(
            &flash,
            STM32F429_SLOT_B_SIGNED_IMAGE_BASE + 1UL,
            data,
            sizeof(data)
        )
    );
    expect_status(
        "program unaligned length",
        BOOT_FLASH_ERR_ALIGNMENT,
        boot_flash_program_aligned(&flash, STM32F429_SLOT_B_SIGNED_IMAGE_BASE, data, 9U)
    );
    expect_status(
        "program active slot rejected",
        BOOT_FLASH_ERR_PROTECTED_REGION,
        boot_flash_program_aligned(&flash, STM32F429_SLOT_A_SIGNED_IMAGE_BASE, data, sizeof(data))
    );
    expect_status(
        "program out of bounds",
        BOOT_FLASH_ERR_OUT_OF_BOUNDS,
        boot_flash_program_aligned(&flash, STM32F429_FLASH_END - 8UL, data, sizeof(data))
    );
    expect_status(
        "program address overflow",
        BOOT_FLASH_ERR_OUT_OF_BOUNDS,
        boot_flash_program_aligned(&flash, UINT32_MAX - 7UL, data, sizeof(data))
    );
    expect_u32("rejected programs did not reach backend", 0U, sim.program_count);

    expect_status(
        "program inactive slot",
        BOOT_FLASH_OK,
        boot_flash_program_aligned(&flash, STM32F429_SLOT_B_SIGNED_IMAGE_BASE, data, sizeof(data))
    );
    memset(readback, 0, sizeof(readback));
    expect_status(
        "read inactive slot",
        BOOT_FLASH_OK,
        boot_flash_read(&flash, STM32F429_SLOT_B_SIGNED_IMAGE_BASE, readback, sizeof(readback))
    );
    if (memcmp(data, readback, sizeof(data)) != 0) {
        printf("readback data mismatch\n");
        failures += 1;
    }

    expect_u32("first programmed address", STM32F429_SLOT_B_SIGNED_IMAGE_BASE, sim.last_program_address);
    expect_u32("first programmed length", (uint32_t)sizeof(data), (uint32_t)sim.last_program_length);

    expect_status(
        "program 0-to-1 rejected",
        BOOT_FLASH_ERR_BACKEND,
        boot_flash_program_aligned(
            &flash,
            STM32F429_SLOT_B_SIGNED_IMAGE_BASE,
            erased_bytes,
            sizeof(erased_bytes)
        )
    );
}

static void test_read_rejects_address_overflow_before_backend(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    uint8_t data[16];

    make_flash(&sim, &flash);
    expect_status(
        "read address overflow",
        BOOT_FLASH_ERR_OUT_OF_BOUNDS,
        boot_flash_read(&flash, UINT32_MAX - 7UL, data, sizeof(data))
    );
    expect_u32("overflow read did not reach backend", 0U, sim.read_count);
}

static void test_readback_verification_failure_is_reported(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    uint8_t data[8] = {0x11U, 0x22U, 0x33U, 0x44U, 0x55U, 0x66U, 0x77U, 0x88U};

    make_flash(&sim, &flash);
    simulated_flash_corrupt_after_program(&sim, 1U);
    expect_status(
        "program verify detects corruption",
        BOOT_FLASH_ERR_VERIFY,
        boot_flash_program_aligned(&flash, STM32F429_BOOT_METADATA_A_BASE, data, sizeof(data))
    );
}

static void test_failure_injection_is_visible(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    uint8_t data[8] = {0U};

    make_flash(&sim, &flash);
    simulated_flash_fail_after(&sim, 1U);
    expect_status(
        "erase failure injection",
        BOOT_FLASH_ERR_BACKEND,
        boot_flash_erase_sector(&flash, STM32F429_BOOT_METADATA_A_FIRST_SECTOR)
    );
    expect_u32("erase attempted once", 1U, sim.erase_count);

    make_flash(&sim, &flash);
    simulated_flash_fail_after(&sim, 1U);
    expect_status(
        "program failure injection",
        BOOT_FLASH_ERR_BACKEND,
        boot_flash_program_aligned(&flash, STM32F429_BOOT_METADATA_A_BASE, data, sizeof(data))
    );
    expect_u32("program attempted once", 1U, sim.program_count);
}

static void test_flash_init_rejects_invalid_policy(void)
{
    boot_flash_t flash;
    simulated_flash_t sim;
    const boot_flash_region_t bad_region[] = {
        {STM32F429_FLASH_END, STM32F429_FLASH_END + 8UL},
    };

    simulated_flash_init(&sim);
    expect_status(
        "bad alignment",
        BOOT_FLASH_ERR_INVALID_ARGUMENT,
        boot_flash_init(&flash, &sim, simulated_flash_ops(), write_regions, 1U, 7U)
    );
    expect_status(
        "bad write region",
        BOOT_FLASH_ERR_OUT_OF_BOUNDS,
        boot_flash_init(&flash, &sim, simulated_flash_ops(), bad_region, 1U, 8U)
    );
}

static boot_metadata_record_t metadata_empty_record(void)
{
    boot_metadata_record_t record;
    expect_metadata_status(
        "empty metadata",
        BOOT_METADATA_OK,
        boot_metadata_empty(&record)
    );
    return record;
}

static boot_metadata_record_t metadata_confirmed(
    const boot_metadata_record_t *current,
    uint32_t slot,
    uint32_t version
)
{
    boot_metadata_record_t next;
    expect_metadata_status(
        "prepare confirmed",
        BOOT_METADATA_OK,
        boot_metadata_prepare_next(
            current,
            BOOT_METADATA_STATE_CONFIRMED,
            slot,
            BOOT_SLOT_NONE,
            version,
            0U,
            1U,
            0U,
            &next
        )
    );
    return next;
}

static boot_metadata_record_t metadata_writing(
    const boot_metadata_record_t *current,
    uint32_t active_slot,
    uint32_t candidate_slot,
    uint32_t version
)
{
    boot_metadata_record_t next;
    expect_metadata_status(
        "prepare writing",
        BOOT_METADATA_OK,
        boot_metadata_prepare_next(
            current,
            BOOT_METADATA_STATE_WRITING,
            active_slot,
            candidate_slot,
            version,
            0U,
            0U,
            0U,
            &next
        )
    );
    return next;
}

