Zimbo88/stm32-security-lab/tests/update_storage/test_update_storage.c
static boot_metadata_record_t metadata_candidate_ready(
    const boot_metadata_record_t *current,
    uint32_t active_slot,
    uint32_t candidate_slot,
    uint32_t version
)
{
    boot_metadata_record_t next;
    expect_metadata_status(
        "prepare candidate ready",
        BOOT_METADATA_OK,
        boot_metadata_prepare_next(
            current,
            BOOT_METADATA_STATE_CANDIDATE_READY,
            active_slot,
            candidate_slot,
            version,
            0U,
            0U,
            0U,
            &next
        )
    );
    return next;
}

static boot_metadata_record_t metadata_pending(
    const boot_metadata_record_t *current,
    uint32_t active_slot,
    uint32_t candidate_slot,
    uint32_t version,
    uint32_t attempts
)
{
    boot_metadata_record_t next;
    expect_metadata_status(
        "prepare pending",
        BOOT_METADATA_OK,
        boot_metadata_prepare_next(
            current,
            BOOT_METADATA_STATE_PENDING_TRIAL,
            active_slot,
            candidate_slot,
            version,
            attempts,
            0U,
            0U,
            &next
        )
    );
    return next;
}

static void init_update_keys(void)
{
    uint8_t seed[32];

    for (uint32_t i = 0U; i < sizeof(seed); ++i) {
        seed[i] = (uint8_t)(0xA0U + i);
    }

    crypto_ed25519_key_pair(update_secret_key, update_public_key, seed);
}

static void sign_package_manifest(uint8_t *package)
{
    crypto_ed25519_sign(
        &package[SIGNED_MANIFEST_SIZE],
        update_secret_key,
        package,
        SIGNED_MANIFEST_SIZE
    );
}

static void refresh_package_hash_and_signature(uint8_t *package)
{
    signed_manifest_t manifest;
    uint8_t payload_hash[SIGNED_PAYLOAD_HASH_SIZE];

    expect_verify_status(
        "decode package for refresh",
        VERIFY_OK,
        signed_image_decode_manifest(package, &manifest)
    );
    crypto_sha512(
        payload_hash,
        &package[SIGNED_IMAGE_HEADER_SIZE],
        (size_t)manifest.image_size
    );
    memcpy(
        &package[offsetof(signed_manifest_t, payload_sha512)],
        payload_hash,
        sizeof(payload_hash)
    );
    sign_package_manifest(package);
}

static size_t build_update_package_for_slot(
    uint32_t slot_id,
    uint32_t image_version,
    uint8_t *package,
    size_t package_capacity
)
{
    const boot_slot_descriptor_t *slot = NULL;
    uint8_t *payload = NULL;
    uint8_t payload_hash[SIGNED_PAYLOAD_HASH_SIZE];
    const size_t package_size =
        (size_t)SIGNED_IMAGE_HEADER_SIZE + TEST_UPDATE_PAYLOAD_SIZE;

    expect_u32(
        "package buffer capacity",
        1U,
        (package_capacity >= package_size) ? 1U : 0U
    );
    expect_u32(
        "lookup package slot",
        BOOT_SLOT_LOOKUP_OK,
        boot_slot_lookup(slot_id, &slot)
    );

    memset(package, 0xFF, package_size);
    payload = &package[SIGNED_IMAGE_HEADER_SIZE];
    memset(payload, 0xA5, TEST_UPDATE_PAYLOAD_SIZE);
    test_store_le32(&payload[0], APPLICATION_MSP_END);
    test_store_le32(&payload[4], slot->payload_base | 1UL);
    crypto_sha512(payload_hash, payload, TEST_UPDATE_PAYLOAD_SIZE);

    test_store_le32(&package[offsetof(signed_manifest_t, magic)], SIGNED_IMAGE_MAGIC);
    test_store_le32(
        &package[offsetof(signed_manifest_t, header_version)],
        UPDATE_PACKAGE_FORMAT_VERSION
    );
    test_store_le32(
        &package[offsetof(signed_manifest_t, image_version)],
        image_version
    );
    test_store_le32(
        &package[offsetof(signed_manifest_t, vector_address)],
        slot->payload_base
    );
    test_store_le32(
        &package[offsetof(signed_manifest_t, image_size)],
        TEST_UPDATE_PAYLOAD_SIZE
    );
    test_store_le32(&package[offsetof(signed_manifest_t, flags)], 0U);
    test_store_le32(
        &package[offsetof(signed_manifest_t, reserved0)],
        UPDATE_PACKAGE_TARGET_STM32F429IGT6_AB_V1
    );
    test_store_le32(
        &package[offsetof(signed_manifest_t, reserved1)],
        UPDATE_PACKAGE_IMAGE_TYPE_APPLICATION
    );
    memcpy(
        &package[offsetof(signed_manifest_t, payload_sha512)],
        payload_hash,
        sizeof(payload_hash)
    );
    sign_package_manifest(package);

    return package_size;
}

static void install_package_bytes_direct(
    simulated_flash_t *sim,
    const boot_slot_descriptor_t *slot,
    const uint8_t *package,
    size_t package_size
)
{
    memcpy(
        &sim->storage[flash_offset(slot->signed_image_base)],
        package,
        package_size
    );
}

typedef struct {
    const boot_flash_t *flash;
    uint8_t *image_buffer;
    size_t image_buffer_size;
    const uint8_t *public_key;
} selection_verify_context_t;

static boot_slot_selection_status_t verify_slot_from_simulated_flash(
    void *context,
    const boot_slot_descriptor_t *slot,
    signed_image_jump_context_t *jump_context,
    verify_status_t *verify_status
)
{
    selection_verify_context_t *config =
        (selection_verify_context_t *)context;
    signed_manifest_t manifest;
    update_package_t package;
    update_package_status_t package_status;
    size_t package_size = 0U;

    if ((config == NULL) ||
        (config->flash == NULL) ||
        (config->image_buffer == NULL) ||
        (config->public_key == NULL) ||
        (slot == NULL) ||
        (jump_context == NULL) ||
        (verify_status == NULL) ||
        (config->image_buffer_size < (size_t)SIGNED_IMAGE_HEADER_SIZE)) {
        return BOOT_SLOT_SELECTION_ERR_INVALID_ARGUMENT;
    }

    *verify_status = VERIFY_BAD_PAYLOAD_RANGE;

    if (boot_flash_read(
            config->flash,
            slot->signed_image_base,
            config->image_buffer,
            (size_t)SIGNED_IMAGE_HEADER_SIZE
        ) != BOOT_FLASH_OK) {
        return BOOT_SLOT_SELECTION_ERR_VERIFY;
    }

    *verify_status = signed_image_decode_manifest(
        config->image_buffer,
        &manifest
    );
    if (*verify_status != VERIFY_OK) {
        return BOOT_SLOT_SELECTION_ERR_VERIFY;
    }

    package_size = (size_t)SIGNED_IMAGE_HEADER_SIZE + (size_t)manifest.image_size;
    if ((package_size < (size_t)SIGNED_IMAGE_HEADER_SIZE) ||
        (package_size > config->image_buffer_size)) {
        return BOOT_SLOT_SELECTION_ERR_VERIFY;
    }

