Zimbo88/stm32-security-lab/tests/update_storage/test_update_storage.c
    if (boot_flash_read(
            config->flash,
            slot->signed_image_base + SIGNED_IMAGE_HEADER_SIZE,
            &config->image_buffer[SIGNED_IMAGE_HEADER_SIZE],
            (size_t)manifest.image_size
        ) != BOOT_FLASH_OK) {
        return BOOT_SLOT_SELECTION_ERR_VERIFY;
    }

    package_status = update_package_verify_for_slot(
        config->image_buffer,
        package_size,
        config->public_key,
        slot,
        &package,
        verify_status
    );
    if (package_status != UPDATE_PACKAGE_OK) {
        return BOOT_SLOT_SELECTION_ERR_VERIFY;
    }

    *verify_status = signed_image_prepare_update_slot_buffer(
        package.manifest_bytes,
        package.payload,
        package.payload_size,
        slot,
        jump_context
    );

    return (*verify_status == VERIFY_OK)
        ? BOOT_SLOT_SELECTION_OK
        : BOOT_SLOT_SELECTION_ERR_VERIFY;
}

static void commit_confirmed_metadata(
    boot_flash_t *flash,
    uint32_t active_slot,
    uint32_t version
)
{
    boot_metadata_record_t empty = metadata_empty_record();
    boot_metadata_record_t confirmed =
        metadata_confirmed(&empty, active_slot, version);

    expect_metadata_status(
        "commit confirmed metadata",
        BOOT_METADATA_OK,
        boot_metadata_commit(flash, &confirmed)
    );
}

static update_install_options_t make_install_options(
    uint8_t *program_buffer,
    uint8_t *readback_buffer,
    uint8_t *installed_buffer,
    update_install_fault_hook_t hook,
    void *hook_context
)
{
    update_install_options_t options;

    options.program_buffer = program_buffer;
    options.program_buffer_size = TEST_INSTALL_PROGRAM_CHUNK;
    options.readback_buffer = readback_buffer;
    options.readback_buffer_size = TEST_INSTALL_PROGRAM_CHUNK;
    options.installed_image_buffer = installed_buffer;
    options.installed_image_buffer_size = TEST_PACKAGE_BUFFER_SIZE;
    options.fault_hook = hook;
    options.fault_context = hook_context;
    return options;
}

typedef struct {
    update_install_fault_point_t point;
    uint32_t detail;
    uint8_t match_detail;
} install_fault_config_t;

static update_install_status_t install_fault_hook(
    void *context,
    update_install_fault_point_t point,
    uint32_t detail
)
{
    const install_fault_config_t *config =
        (const install_fault_config_t *)context;

    if ((config != NULL) &&
        (config->point == point) &&
        ((config->match_detail == 0U) || (config->detail == detail))) {
        return UPDATE_INSTALL_ERR_INJECTED;
    }

    return UPDATE_INSTALL_OK;
}

typedef struct {
    boot_slot_selection_fault_point_t point;
    uint32_t detail;
    uint8_t match_detail;
} selection_fault_config_t;

static boot_slot_selection_status_t selection_fault_hook(
    void *context,
    boot_slot_selection_fault_point_t point,
    uint32_t detail
)
{
    const selection_fault_config_t *config =
        (const selection_fault_config_t *)context;

    if ((config != NULL) &&
        (config->point == point) &&
        ((config->match_detail == 0U) || (config->detail == detail))) {
        return BOOT_SLOT_SELECTION_ERR_INJECTED;
    }

    return BOOT_SLOT_SELECTION_OK;
}

static size_t setup_standard_install(
    simulated_flash_t *sim,
    boot_flash_t *flash,
    uint32_t active_slot_id,
    uint32_t active_version,
    uint32_t package_version,
    uint8_t *package,
    size_t package_capacity,
    const boot_slot_descriptor_t **active,
    const boot_slot_descriptor_t **candidate
)
{
    make_installer_flash(sim, flash);
    commit_confirmed_metadata(flash, active_slot_id, active_version);

    expect_u32(
        "lookup setup active slot",
        BOOT_SLOT_LOOKUP_OK,
        boot_slot_lookup(active_slot_id, active)
    );
    const uint32_t candidate_slot_id =
        (active_slot_id == (uint32_t)BOOT_SLOT_A)
            ? (uint32_t)BOOT_SLOT_B
            : (uint32_t)BOOT_SLOT_A;
    expect_u32(
        "lookup setup candidate slot",
        BOOT_SLOT_LOOKUP_OK,
        boot_slot_lookup(candidate_slot_id, candidate)
    );

    prepare_protected_snapshots(sim, *active);
    return build_update_package_for_slot(
        candidate_slot_id,
        package_version,
        package,
        package_capacity
    );
}

static boot_metadata_record_t commit_candidate_ready_metadata(
    boot_flash_t *flash,
    uint32_t active_slot,
    uint32_t active_version,
    uint32_t candidate_slot,
    uint32_t candidate_version
)
{
    boot_metadata_record_t empty = metadata_empty_record();
    boot_metadata_record_t confirmed =
        metadata_confirmed(&empty, active_slot, active_version);
    boot_metadata_record_t writing =
        metadata_writing(&confirmed, active_slot, candidate_slot, candidate_version);
    boot_metadata_record_t ready =
        metadata_candidate_ready(&writing, active_slot, candidate_slot, candidate_version);

    expect_metadata_status(
        "commit selection confirmed",
        BOOT_METADATA_OK,
        boot_metadata_commit(flash, &confirmed)
    );
    expect_metadata_status(
        "commit selection writing",
        BOOT_METADATA_OK,
        boot_metadata_commit(flash, &writing)
    );
    expect_metadata_status(
        "commit selection ready",
        BOOT_METADATA_OK,
        boot_metadata_commit(flash, &ready)
    );
    return ready;
}

static boot_metadata_record_t commit_pending_metadata(
    boot_flash_t *flash,
    uint32_t active_slot,
    uint32_t active_version,
    uint32_t candidate_slot,
    uint32_t candidate_version,
    uint32_t attempts
)
{
    boot_metadata_record_t ready = commit_candidate_ready_metadata(
        flash,
        active_slot,
        active_version,
        candidate_slot,
        candidate_version
    );
    boot_metadata_record_t pending = metadata_pending(
        &ready,
        active_slot,
        candidate_slot,
        candidate_version,
        attempts
    );

    expect_metadata_status(
        "commit selection pending",
        BOOT_METADATA_OK,
        boot_metadata_commit(flash, &pending)
    );
    return pending;
}

static void setup_selection_images(
    simulated_flash_t *sim,
    uint32_t active_slot_id,
    uint32_t active_version,
    uint32_t candidate_version,
    const boot_slot_descriptor_t **active,
    const boot_slot_descriptor_t **candidate
)
{
    uint8_t package[TEST_PACKAGE_BUFFER_SIZE];
    size_t package_size = 0U;
    const uint32_t candidate_slot_id =
        (active_slot_id == (uint32_t)BOOT_SLOT_A)
            ? (uint32_t)BOOT_SLOT_B
            : (uint32_t)BOOT_SLOT_A;

    expect_u32(
        "lookup selection active",
        BOOT_SLOT_LOOKUP_OK,
        boot_slot_lookup(active_slot_id, active)
    );
    expect_u32(
        "lookup selection candidate",
        BOOT_SLOT_LOOKUP_OK,
        boot_slot_lookup(candidate_slot_id, candidate)
    );

    package_size = build_update_package_for_slot(
        active_slot_id,
        active_version,
        package,
        sizeof(package)
    );
    install_package_bytes_direct(sim, *active, package, package_size);

    package_size = build_update_package_for_slot(
        candidate_slot_id,
        candidate_version,
        package,
        sizeof(package)
    );
    install_package_bytes_direct(sim, *candidate, package, package_size);
}

static boot_slot_selection_options_t make_selection_options(
    const boot_flash_t *flash,
    selection_verify_context_t *verify_context,
    uint8_t *image_buffer,
    boot_slot_selection_fault_hook_t fault_hook,
    void *fault_context
)
{
    verify_context->flash = flash;
    verify_context->image_buffer = image_buffer;
    verify_context->image_buffer_size = TEST_PACKAGE_BUFFER_SIZE;
    verify_context->public_key = update_public_key;

    boot_slot_selection_options_t options = {
        .metadata_flash = flash,
        .verify_slot = verify_slot_from_simulated_flash,
        .verify_context = verify_context,
        .fault_hook = fault_hook,
        .fault_context = fault_context,
    };

    return options;
}

static void expect_no_forbidden_writes(
    const simulated_flash_t *sim,
    const boot_slot_descriptor_t *active
)
{
    expect_u32("write log did not overflow", 0U, sim->write_log_overflow);
    expect_u32(
        "no Stage 0 writes",
        0U,
        count_writes_in_range(
            sim,
            STM32F429_BOOTLOADER_BASE,
            STM32F429_BOOTLOADER_END
        )
    );
    expect_u32(
        "no active-slot writes",
        0U,
        count_writes_in_range(sim, active->signed_image_base, active->slot_end)
    );
    expect_u32(
        "no recovery writes",
        0U,
        count_writes_in_range(sim, STM32F429_RECOVERY_BASE, STM32F429_RECOVERY_END)
    );
    expect_u32(
        "no update-metadata raw writes",
        0U,
        count_writes_in_range(
            sim,
            STM32F429_UPDATE_METADATA_BASE,
            STM32F429_UPDATE_METADATA_END
        )
    );
}

static void expect_install_failure_invariants(
    const simulated_flash_t *sim,
    const boot_flash_t *flash,
    const boot_slot_descriptor_t *active
)
{
    boot_metadata_record_t recovered;
    boot_metadata_status_t metadata_status =
        boot_metadata_recover_from_flash(flash, &recovered, NULL);

    expect_protected_regions_unchanged(sim, active);
    expect_no_forbidden_writes(sim, active);
    if (metadata_status == BOOT_METADATA_OK &&
        recovered.state == BOOT_METADATA_STATE_CANDIDATE_READY) {
        printf("failed install marked candidate ready\n");
        failures += 1;
    }
}

static void test_metadata_encode_decode_and_recovery(void)
{
    boot_metadata_record_t empty = metadata_empty_record();
    boot_metadata_record_t confirmed =
        metadata_confirmed(&empty, BOOT_SLOT_A, 2U);
    boot_metadata_record_t decoded;
    boot_metadata_record_t selected;
    boot_metadata_recovery_t recovery;
    uint8_t copy_a[STM32F429_BOOT_METADATA_RECORD_SIZE];
    uint8_t copy_b[STM32F429_BOOT_METADATA_RECORD_SIZE];

    expect_metadata_status(
        "encode confirmed",
        BOOT_METADATA_OK,
        boot_metadata_encode(&confirmed, copy_a)
    );
    expect_metadata_status(
        "decode confirmed",
        BOOT_METADATA_OK,
        boot_metadata_decode(copy_a, sizeof(copy_a), &decoded)
    );
    expect_metadata_record(
        "decoded confirmed",
        &decoded,
        1U,
        BOOT_METADATA_STATE_CONFIRMED,
        BOOT_SLOT_A,
        BOOT_SLOT_NONE,
        2U
    );

    memcpy(copy_b, copy_a, sizeof(copy_b));
    copy_b[12] ^= 0x01U;
    expect_metadata_status(
        "corrupt crc rejected",
        BOOT_METADATA_ERR_CRC,
        boot_metadata_decode(copy_b, sizeof(copy_b), &decoded)
    );

    memset(copy_b, 0xFF, sizeof(copy_b));
    expect_metadata_status(
        "recover single copy",
        BOOT_METADATA_OK,
        boot_metadata_recover(copy_a, copy_b, sizeof(copy_a), &selected, &recovery)
    );
    expect_u32("copy A valid", 1U, recovery.copy_a_valid);
    expect_u32("copy B invalid", 0U, recovery.copy_b_valid);
    expect_u32("selected copy A", BOOT_METADATA_COPY_A, recovery.selected_copy);
    expect_metadata_record(
        "selected confirmed",
        &selected,
        1U,
        BOOT_METADATA_STATE_CONFIRMED,
        BOOT_SLOT_A,
        BOOT_SLOT_NONE,
        2U
    );

    boot_metadata_record_t writing =
        metadata_writing(&confirmed, BOOT_SLOT_A, BOOT_SLOT_B, 3U);
    expect_metadata_status(
        "encode writing",
        BOOT_METADATA_OK,
        boot_metadata_encode(&writing, copy_b)
    );
    expect_metadata_status(
        "recover highest sequence",
        BOOT_METADATA_OK,
        boot_metadata_recover(copy_a, copy_b, sizeof(copy_a), &selected, &recovery)
    );
    expect_u32("selected copy B", BOOT_METADATA_COPY_B, recovery.selected_copy);
    expect_metadata_record(
        "selected writing",
        &selected,
        2U,
        BOOT_METADATA_STATE_WRITING,
        BOOT_SLOT_A,
        BOOT_SLOT_B,
        3U
    );

    memset(copy_a, 0xFF, sizeof(copy_a));
    memset(copy_b, 0xFF, sizeof(copy_b));
    expect_metadata_status(
        "both copies invalid",
        BOOT_METADATA_ERR_NO_VALID_COPY,
        boot_metadata_recover(copy_a, copy_b, sizeof(copy_a), &selected, &recovery)
    );
    expect_metadata_record(
        "selected empty after invalid",
        &selected,
        0U,
        BOOT_METADATA_STATE_EMPTY,
        BOOT_SLOT_NONE,
        BOOT_SLOT_NONE,
        0U
    );
}

static void test_metadata_rejects_noncanonical_records(void)
{
    boot_metadata_record_t empty = metadata_empty_record();
    boot_metadata_record_t confirmed =
        metadata_confirmed(&empty, BOOT_SLOT_A, 2U);
    boot_metadata_record_t decoded;
    uint8_t encoded[STM32F429_BOOT_METADATA_RECORD_SIZE];

    expect_metadata_status(
        "encode confirmed for corruption tests",
        BOOT_METADATA_OK,
        boot_metadata_encode(&confirmed, encoded)
    );

    test_store_le32(&encoded[16], 99UL);
    refresh_metadata_crc(encoded);
    expect_metadata_status(
        "decode unknown state rejected",
        BOOT_METADATA_ERR_BAD_FORMAT,
        boot_metadata_decode(encoded, sizeof(encoded), &decoded)
    );

    expect_metadata_status(
        "re-encode confirmed for slot corruption",
        BOOT_METADATA_OK,
        boot_metadata_encode(&confirmed, encoded)
    );
    test_store_le32(&encoded[20], 99UL);
    refresh_metadata_crc(encoded);
    expect_metadata_status(
        "decode invalid active slot rejected",
        BOOT_METADATA_ERR_BAD_FORMAT,
        boot_metadata_decode(encoded, sizeof(encoded), &decoded)
    );

    expect_metadata_status(
        "re-encode confirmed for reserved corruption",
        BOOT_METADATA_OK,
        boot_metadata_encode(&confirmed, encoded)
    );
    test_store_le32(&encoded[44], 1UL);
    refresh_metadata_crc(encoded);
    expect_metadata_status(
        "decode reserved field rejected",
        BOOT_METADATA_ERR_BAD_FORMAT,
        boot_metadata_decode(encoded, sizeof(encoded), &decoded)
    );

    expect_metadata_status(
        "re-encode confirmed for padding corruption",
        BOOT_METADATA_OK,
        boot_metadata_encode(&confirmed, encoded)
    );
    encoded[TEST_METADATA_PADDING_OFFSET] = 1U;
    expect_metadata_status(
        "decode padding rejected",
        BOOT_METADATA_ERR_BAD_FORMAT,
        boot_metadata_decode(encoded, sizeof(encoded), &decoded)
    );

    expect_metadata_status(
        "re-encode confirmed for commit corruption",
        BOOT_METADATA_OK,
        boot_metadata_encode(&confirmed, encoded)
    );
    encoded[TEST_METADATA_COMMIT_OFFSET] ^= 1U;
    expect_metadata_status(
        "decode missing commit marker rejected",
        BOOT_METADATA_ERR_BAD_FORMAT,
        boot_metadata_decode(encoded, sizeof(encoded), &decoded)
    );

    expect_metadata_status(
        "decode truncated metadata rejected",
        BOOT_METADATA_ERR_BAD_FORMAT,
        boot_metadata_decode(
            encoded,
            STM32F429_BOOT_METADATA_RECORD_SIZE - 1U,
            &decoded
        )
    );

