Zimbo88/stm32-security-lab/tests/update_storage/test_update_storage.c
    for (uint32_t block = 0U; block < 6U; block += 5U) {
        static simulated_flash_t sim;
        boot_flash_t flash;
        const boot_slot_descriptor_t *active = NULL;
        const boot_slot_descriptor_t *candidate = NULL;
        uint8_t package[TEST_PACKAGE_BUFFER_SIZE];
        uint8_t program_buffer[TEST_INSTALL_PROGRAM_CHUNK];
        uint8_t readback_buffer[TEST_INSTALL_PROGRAM_CHUNK];
        uint8_t installed_buffer[TEST_PACKAGE_BUFFER_SIZE];

        const size_t package_size = setup_standard_install(
            &sim,
            &flash,
            BOOT_SLOT_A,
            2U,
            3U,
            package,
            sizeof(package),
            &active,
            &candidate
        );
        simulated_flash_fail_before_program_address(
            &sim,
            candidate->signed_image_base + (block * TEST_INSTALL_PROGRAM_CHUNK)
        );
        update_install_options_t options = make_install_options(
            program_buffer,
            readback_buffer,
            installed_buffer,
            NULL,
            NULL
        );
        expect_install_status(
            "program failure",
            UPDATE_INSTALL_ERR_PROGRAM,
            update_installer_install(
                &flash,
                package,
                package_size,
                update_public_key,
                &options,
                NULL
            )
        );
        expect_install_failure_invariants(&sim, &flash, active);
    }

    {
        static simulated_flash_t sim;
        boot_flash_t flash;
        const boot_slot_descriptor_t *active = NULL;
        const boot_slot_descriptor_t *candidate = NULL;
        uint8_t package[TEST_PACKAGE_BUFFER_SIZE];
        uint8_t program_buffer[TEST_INSTALL_PROGRAM_CHUNK];
        uint8_t readback_buffer[TEST_INSTALL_PROGRAM_CHUNK];
        uint8_t installed_buffer[TEST_PACKAGE_BUFFER_SIZE];

        const size_t package_size = setup_standard_install(
            &sim,
            &flash,
            BOOT_SLOT_A,
            2U,
            3U,
            package,
            sizeof(package),
            &active,
            &candidate
        );
        simulated_flash_fail_before_read_address(&sim, candidate->signed_image_base);
        update_install_options_t options = make_install_options(
            program_buffer,
            readback_buffer,
            installed_buffer,
            NULL,
            NULL
        );
        expect_install_status(
            "flash read-back failure",
            UPDATE_INSTALL_ERR_PROGRAM,
            update_installer_install(
                &flash,
                package,
                package_size,
                update_public_key,
                &options,
                NULL
            )
        );
        expect_install_failure_invariants(&sim, &flash, active);
    }

    {
        static simulated_flash_t sim;
        boot_flash_t flash;
        const boot_slot_descriptor_t *active = NULL;
        const boot_slot_descriptor_t *candidate = NULL;
        uint8_t package[TEST_PACKAGE_BUFFER_SIZE];
        uint8_t program_buffer[TEST_INSTALL_PROGRAM_CHUNK];
        uint8_t readback_buffer[TEST_INSTALL_PROGRAM_CHUNK];
        uint8_t installed_buffer[TEST_PACKAGE_BUFFER_SIZE];

        const size_t package_size = setup_standard_install(
            &sim,
            &flash,
            BOOT_SLOT_A,
            2U,
            3U,
            package,
            sizeof(package),
            &active,
            &candidate
        );
        simulated_flash_fail_before_program_address(
            &sim,
            STM32F429_BOOT_METADATA_A_BASE + TEST_METADATA_COMMIT_OFFSET
        );
        update_install_options_t options = make_install_options(
            program_buffer,
            readback_buffer,
            installed_buffer,
            NULL,
            NULL
        );
        expect_install_status(
            "candidate-ready commit marker failure",
            UPDATE_INSTALL_ERR_METADATA,
            update_installer_install(
                &flash,
                package,
                package_size,
                update_public_key,
                &options,
                NULL
            )
        );
        expect_install_failure_invariants(&sim, &flash, active);
    }
}

static update_install_status_t enable_corrupt_after_program_hook(
    void *context,
    update_install_fault_point_t point,
    uint32_t detail
);

static void test_update_installer_detects_post_program_corruption(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    const boot_slot_descriptor_t *active = NULL;
    const boot_slot_descriptor_t *candidate = NULL;
    uint8_t package[TEST_PACKAGE_BUFFER_SIZE];
    uint8_t program_buffer[TEST_INSTALL_PROGRAM_CHUNK];
    uint8_t readback_buffer[TEST_INSTALL_PROGRAM_CHUNK];
    uint8_t installed_buffer[TEST_PACKAGE_BUFFER_SIZE];

    const size_t package_size = setup_standard_install(
        &sim,
        &flash,
        BOOT_SLOT_A,
        2U,
        3U,
        package,
        sizeof(package),
        &active,
        &candidate
    );
    (void)candidate;
    update_install_options_t options = make_install_options(
        program_buffer,
        readback_buffer,
        installed_buffer,
        enable_corrupt_after_program_hook,
        &sim
    );
    expect_install_status(
        "read-back mismatch after programming",
        UPDATE_INSTALL_ERR_PROGRAM,
        update_installer_install(
            &flash,
            package,
            package_size,
            update_public_key,
            &options,
            NULL
        )
    );
    expect_install_failure_invariants(&sim, &flash, active);
}

static update_install_status_t enable_corrupt_after_program_hook(
    void *context,
    update_install_fault_point_t point,
    uint32_t detail
)
{
    simulated_flash_t *sim = (simulated_flash_t *)context;

    if ((sim != NULL) &&
        (point == UPDATE_INSTALL_FAULT_PROGRAM_BLOCK) &&
        (detail == 0U)) {
        simulated_flash_corrupt_after_program(sim, 1U);
    }

