Zimbo88/stm32-security-lab/tests/update_storage/test_update_storage.c
    return UPDATE_INSTALL_OK;
}

typedef struct {
    simulated_flash_t *sim;
    uint32_t corrupt_address;
} corrupt_hash_read_context_t;

static update_install_status_t corrupt_hash_read_hook(
    void *context,
    update_install_fault_point_t point,
    uint32_t detail
)
{
    corrupt_hash_read_context_t *config =
        (corrupt_hash_read_context_t *)context;

    if ((config != NULL) &&
        (point == UPDATE_INSTALL_FAULT_HASH_BEGIN)) {
        (void)detail;
        simulated_flash_corrupt_read_address(config->sim, config->corrupt_address);
    }

    return UPDATE_INSTALL_OK;
}

static update_install_status_t corrupt_installed_verify_hook(
    void *context,
    update_install_fault_point_t point,
    uint32_t detail
)
{
    uint8_t *installed_buffer = (uint8_t *)context;
    (void)detail;

    if ((installed_buffer != NULL) &&
        (point == UPDATE_INSTALL_FAULT_VERIFY_INSTALLED)) {
        installed_buffer[SIGNED_MANIFEST_SIZE] ^= 0x01U;
    }

    return UPDATE_INSTALL_OK;
}

static void test_update_installer_detects_final_hash_mismatch(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    const boot_slot_descriptor_t *active = NULL;
    const boot_slot_descriptor_t *candidate = NULL;
    uint8_t package[TEST_PACKAGE_BUFFER_SIZE];
    uint8_t program_buffer[TEST_INSTALL_PROGRAM_CHUNK];
    uint8_t readback_buffer[TEST_INSTALL_PROGRAM_CHUNK];
    uint8_t installed_buffer[TEST_PACKAGE_BUFFER_SIZE];

    const size_t package_size = setup_standard_install(
        &sim,
        &flash,
        BOOT_SLOT_A,
        2U,
        3U,
        package,
        sizeof(package),
        &active,
        &candidate
    );
    corrupt_hash_read_context_t context = {
        .sim = &sim,
        .corrupt_address = candidate->payload_base,
    };
    update_install_options_t options = make_install_options(
        program_buffer,
        readback_buffer,
        installed_buffer,
        corrupt_hash_read_hook,
        &context
    );
    expect_install_status(
        "final hash mismatch",
        UPDATE_INSTALL_ERR_HASH,
        update_installer_install(
            &flash,
            package,
            package_size,
            update_public_key,
            &options,
            NULL
        )
    );
    expect_install_failure_invariants(&sim, &flash, active);
}

static void test_update_installer_detects_verifier_failure_after_programming(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    const boot_slot_descriptor_t *active = NULL;
    const boot_slot_descriptor_t *candidate = NULL;
    uint8_t package[TEST_PACKAGE_BUFFER_SIZE];
    uint8_t program_buffer[TEST_INSTALL_PROGRAM_CHUNK];
    uint8_t readback_buffer[TEST_INSTALL_PROGRAM_CHUNK];
    uint8_t installed_buffer[TEST_PACKAGE_BUFFER_SIZE];

    const size_t package_size = setup_standard_install(
        &sim,
        &flash,
        BOOT_SLOT_A,
        2U,
        3U,
        package,
        sizeof(package),
        &active,
        &candidate
    );
    (void)candidate;
    update_install_options_t options = make_install_options(
        program_buffer,
        readback_buffer,
        installed_buffer,
        corrupt_installed_verify_hook,
        installed_buffer
    );
    expect_install_status(
        "verifier failure after programming",
        UPDATE_INSTALL_ERR_INSTALLED_VERIFY,
        update_installer_install(
            &flash,
            package,
            package_size,
            update_public_key,
            &options,
            NULL
        )
    );
    expect_install_failure_invariants(&sim, &flash, active);
}

static void test_slot_selection_successful_upgrade_and_confirmation(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    const boot_slot_descriptor_t *active = NULL;
    const boot_slot_descriptor_t *candidate = NULL;
    uint8_t image_buffer[TEST_PACKAGE_BUFFER_SIZE];
    selection_verify_context_t verify_context;
    boot_slot_selection_result_t selection;
    boot_confirm_result_t confirmation;
    boot_metadata_record_t recovered;

    make_installer_flash(&sim, &flash);
    setup_selection_images(
        &sim,
        BOOT_SLOT_A,
        2U,
        3U,
        &active,
        &candidate
    );
    commit_candidate_ready_metadata(
        &flash,
        BOOT_SLOT_A,
        2U,
        BOOT_SLOT_B,
        3U
    );

    boot_slot_selection_options_t options = make_selection_options(
        &flash,
        &verify_context,
        image_buffer,
        NULL,
        NULL
    );
    expect_selection_status(
        "candidate ready selects trial",
        BOOT_SLOT_SELECTION_OK,
        boot_slot_selection_select(&options, &selection)
    );
    expect_u32("trial decision", BOOT_SLOT_SELECTION_DECISION_TRIAL, selection.decision);
    expect_u32("trial selected candidate", candidate->id, selection.selected_slot);
    expect_u32(
        "trial attempts decremented",
        BOOT_METADATA_MAX_BOOT_ATTEMPTS - 1UL,
        selection.attempts_remaining_after
    );
    expect_verify_status("trial verify status", VERIFY_OK, selection.selected_verify_status);

    expect_metadata_status(
        "recover pending after trial select",
        BOOT_METADATA_OK,
        boot_metadata_recover_from_flash(&flash, &recovered, NULL)
    );
    expect_metadata_record(
        "pending trial metadata",
        &recovered,
        4U,
        BOOT_METADATA_STATE_PENDING_TRIAL,
        BOOT_SLOT_A,
        BOOT_SLOT_B,
        3U
    );
    expect_u32(
        "pending attempts remaining",
        BOOT_METADATA_MAX_BOOT_ATTEMPTS - 1UL,
        recovered.boot_attempt_count
    );

    expect_confirm_status(
        "confirm running candidate",
        BOOT_CONFIRM_OK,
        boot_confirm_current_slot(&flash, BOOT_SLOT_B, &confirmation)
    );
    expect_u32("confirmed slot B", BOOT_SLOT_B, confirmation.confirmed_slot);
    expect_u32("confirmed version", 3U, confirmation.image_version);

    expect_metadata_status(
        "recover confirmed after app confirmation",
        BOOT_METADATA_OK,
        boot_metadata_recover_from_flash(&flash, &recovered, NULL)
    );
    expect_metadata_record(
        "confirmed candidate metadata",
        &recovered,
        5U,
        BOOT_METADATA_STATE_CONFIRMED,
        BOOT_SLOT_B,
        BOOT_SLOT_NONE,
        3U
    );

