Zimbo88/stm32-security-lab/tests/update_storage/test_update_storage.c
    expect_confirm_status(
        "confirmation is idempotent",
        BOOT_CONFIRM_OK,
        boot_confirm_current_slot(&flash, BOOT_SLOT_B, &confirmation)
    );
    expect_u32("idempotent confirmation", 1U, confirmation.already_confirmed);

    expect_selection_status(
        "confirmed new slot boots",
        BOOT_SLOT_SELECTION_OK,
        boot_slot_selection_select(&options, &selection)
    );
    expect_u32("confirmed decision", BOOT_SLOT_SELECTION_DECISION_CONFIRMED, selection.decision);
    expect_u32("confirmed selected slot B", BOOT_SLOT_B, selection.selected_slot);
    (void)active;
}

static void test_slot_selection_missing_confirmation_exhausts_attempts(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    const boot_slot_descriptor_t *active = NULL;
    const boot_slot_descriptor_t *candidate = NULL;
    uint8_t image_buffer[TEST_PACKAGE_BUFFER_SIZE];
    selection_verify_context_t verify_context;
    boot_slot_selection_result_t selection;
    boot_metadata_record_t recovered;

    make_installer_flash(&sim, &flash);
    setup_selection_images(
        &sim,
        BOOT_SLOT_A,
        2U,
        3U,
        &active,
        &candidate
    );
    commit_candidate_ready_metadata(
        &flash,
        BOOT_SLOT_A,
        2U,
        BOOT_SLOT_B,
        3U
    );
    boot_slot_selection_options_t options = make_selection_options(
        &flash,
        &verify_context,
        image_buffer,
        NULL,
        NULL
    );

    for (uint32_t expected_after = BOOT_METADATA_MAX_BOOT_ATTEMPTS - 1UL;
         expected_after != UINT32_MAX;
         --expected_after) {
        expect_selection_status(
            "repeated reset trial selection",
            BOOT_SLOT_SELECTION_OK,
            boot_slot_selection_select(&options, &selection)
        );
        expect_u32("trial selected slot", candidate->id, selection.selected_slot);
        expect_u32("trial decision while attempts remain", BOOT_SLOT_SELECTION_DECISION_TRIAL, selection.decision);
        expect_u32("attempt counter after reset", expected_after, selection.attempts_remaining_after);
        if (expected_after == 0U) {
            break;
        }
    }

    expect_selection_status(
        "attempt exhaustion falls back",
        BOOT_SLOT_SELECTION_OK,
        boot_slot_selection_select(&options, &selection)
    );
    expect_u32("fallback decision after exhaustion", BOOT_SLOT_SELECTION_DECISION_FALLBACK, selection.decision);
    expect_u32("fallback selected active", active->id, selection.selected_slot);

    expect_metadata_status(
        "recover rejected after exhaustion",
        BOOT_METADATA_OK,
        boot_metadata_recover_from_flash(&flash, &recovered, NULL)
    );
    expect_metadata_record(
        "exhausted trial rejected",
        &recovered,
        7U,
        BOOT_METADATA_STATE_REJECTED_INVALID,
        BOOT_SLOT_A,
        BOOT_SLOT_B,
        3U
    );
    expect_u32(
        "exhaustion result code",
        BOOT_SLOT_SELECTION_RESULT_ATTEMPTS_EXHAUSTED,
        recovered.result
    );
}

static void test_slot_selection_invalid_candidate_falls_back(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    const boot_slot_descriptor_t *active = NULL;
    const boot_slot_descriptor_t *candidate = NULL;
    uint8_t image_buffer[TEST_PACKAGE_BUFFER_SIZE];
    selection_verify_context_t verify_context;
    boot_slot_selection_result_t selection;
    boot_metadata_record_t recovered;

    make_installer_flash(&sim, &flash);
    setup_selection_images(
        &sim,
        BOOT_SLOT_A,
        2U,
        3U,
        &active,
        &candidate
    );
    commit_candidate_ready_metadata(
        &flash,
        BOOT_SLOT_A,
        2U,
        BOOT_SLOT_B,
        3U
    );
    sim.storage[
        flash_offset(
            candidate->signed_image_base +
            SIGNED_IMAGE_HEADER_SIZE +
            APPLICATION_VECTOR_MIN_SIZE
        )
    ] ^= 0x01U;

    boot_slot_selection_options_t options = make_selection_options(
        &flash,
        &verify_context,
        image_buffer,
        NULL,
        NULL
    );
    expect_selection_status(
        "bad candidate falls back",
        BOOT_SLOT_SELECTION_OK,
        boot_slot_selection_select(&options, &selection)
    );
    expect_u32("fallback after bad candidate", BOOT_SLOT_SELECTION_DECISION_FALLBACK, selection.decision);
    expect_u32("fallback selected active after bad candidate", active->id, selection.selected_slot);
    expect_u32("bad candidate fallback cause", BOOT_SLOT_SELECTION_ERR_VERIFY, selection.fallback_cause);
    expect_verify_status(
        "candidate hash failure recorded",
        VERIFY_BAD_PAYLOAD_HASH,
        selection.candidate_verify_status
    );

    expect_metadata_status(
        "recover rejected after bad candidate",
        BOOT_METADATA_OK,
        boot_metadata_recover_from_flash(&flash, &recovered, NULL)
    );
    expect_metadata_record(
        "bad candidate rejected metadata",
        &recovered,
        4U,
        BOOT_METADATA_STATE_REJECTED_INVALID,
        BOOT_SLOT_A,
        BOOT_SLOT_B,
        3U
    );
    expect_u32(
        "bad candidate result code",
        BOOT_SLOT_SELECTION_RESULT_CANDIDATE_VERIFY_FAILED,
        recovered.result
    );
}

static void test_slot_selection_recovers_torn_metadata_copy(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    const boot_slot_descriptor_t *active = NULL;
    const boot_slot_descriptor_t *candidate = NULL;
    uint8_t image_buffer[TEST_PACKAGE_BUFFER_SIZE];
    selection_verify_context_t verify_context;
    boot_slot_selection_result_t selection;
    boot_metadata_record_t empty = metadata_empty_record();
    boot_metadata_record_t confirmed =
        metadata_confirmed(&empty, BOOT_SLOT_A, 2U);
    boot_metadata_record_t confirmed_again =
        metadata_confirmed(&confirmed, BOOT_SLOT_A, 2U);

    make_installer_flash(&sim, &flash);
    setup_selection_images(
        &sim,
        BOOT_SLOT_A,
        2U,
        3U,
        &active,
        &candidate
    );
    expect_metadata_status(
        "commit confirmed copy A",
        BOOT_METADATA_OK,
        boot_metadata_commit(&flash, &confirmed)
    );
    expect_metadata_status(
        "commit confirmed copy B",
        BOOT_METADATA_OK,
        boot_metadata_commit(&flash, &confirmed_again)
    );

