Zimbo88/stm32-security-lab/tests/update_storage/test_update_storage.c
    sim.storage[flash_offset(STM32F429_BOOT_METADATA_B_BASE)] ^= 0x01U;
    boot_slot_selection_options_t options = make_selection_options(
        &flash,
        &verify_context,
        image_buffer,
        NULL,
        NULL
    );
    expect_selection_status(
        "recover one corrupt metadata copy",
        BOOT_SLOT_SELECTION_OK,
        boot_slot_selection_select(&options, &selection)
    );
    expect_u32("single-copy recovery decision", BOOT_SLOT_SELECTION_DECISION_CONFIRMED, selection.decision);
    expect_u32("single-copy selected active", active->id, selection.selected_slot);
    expect_u32("copy A valid after corruption", 1U, selection.metadata_recovery.copy_a_valid);
    expect_u32("copy B invalid after corruption", 0U, selection.metadata_recovery.copy_b_valid);
    (void)candidate;
}

static void test_slot_selection_rejects_ambiguous_or_invalid_metadata(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    const boot_slot_descriptor_t *active = NULL;
    const boot_slot_descriptor_t *candidate = NULL;
    uint8_t image_buffer[TEST_PACKAGE_BUFFER_SIZE];
    selection_verify_context_t verify_context;
    boot_slot_selection_result_t selection;
    uint8_t copy_a[STM32F429_BOOT_METADATA_RECORD_SIZE];
    uint8_t copy_b[STM32F429_BOOT_METADATA_RECORD_SIZE];
    boot_metadata_record_t empty = metadata_empty_record();
    boot_metadata_record_t confirmed_a =
        metadata_confirmed(&empty, BOOT_SLOT_A, 2U);
    boot_metadata_record_t confirmed_b = confirmed_a;

    make_installer_flash(&sim, &flash);
    setup_selection_images(
        &sim,
        BOOT_SLOT_A,
        2U,
        3U,
        &active,
        &candidate
    );
    confirmed_b.active_slot = BOOT_SLOT_B;
    expect_metadata_status(
        "encode selection ambiguous A",
        BOOT_METADATA_OK,
        boot_metadata_encode(&confirmed_a, copy_a)
    );
    expect_metadata_status(
        "encode selection ambiguous B",
        BOOT_METADATA_OK,
        boot_metadata_encode(&confirmed_b, copy_b)
    );
    memcpy(&sim.storage[flash_offset(STM32F429_BOOT_METADATA_A_BASE)], copy_a, sizeof(copy_a));
    memcpy(&sim.storage[flash_offset(STM32F429_BOOT_METADATA_B_BASE)], copy_b, sizeof(copy_b));

    boot_slot_selection_options_t options = make_selection_options(
        &flash,
        &verify_context,
        image_buffer,
        NULL,
        NULL
    );
    expect_selection_status(
        "ambiguous metadata fails closed",
        BOOT_SLOT_SELECTION_ERR_AMBIGUOUS_METADATA,
        boot_slot_selection_select(&options, &selection)
    );

    make_installer_flash(&sim, &flash);
    expect_metadata_status(
        "encode invalid active slot source",
        BOOT_METADATA_OK,
        boot_metadata_encode(&confirmed_a, copy_a)
    );
    test_store_le32(&copy_a[20], 99UL);
    refresh_metadata_crc(copy_a);
    memcpy(&sim.storage[flash_offset(STM32F429_BOOT_METADATA_A_BASE)], copy_a, sizeof(copy_a));
    expect_selection_status(
        "invalid slot metadata rejected",
        BOOT_SLOT_SELECTION_ERR_METADATA,
        boot_slot_selection_select(&options, &selection)
    );

    make_installer_flash(&sim, &flash);
    expect_selection_status(
        "both metadata copies invalid fails closed",
        BOOT_SLOT_SELECTION_ERR_METADATA,
        boot_slot_selection_select(&options, &selection)
    );
    (void)active;
    (void)candidate;
}

static void test_slot_selection_power_loss_before_attempt_commit_falls_back(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    const boot_slot_descriptor_t *active = NULL;
    const boot_slot_descriptor_t *candidate = NULL;
    uint8_t image_buffer[TEST_PACKAGE_BUFFER_SIZE];
    selection_verify_context_t verify_context;
    boot_slot_selection_result_t selection;
    boot_metadata_record_t recovered;

    make_installer_flash(&sim, &flash);
    setup_selection_images(
        &sim,
        BOOT_SLOT_A,
        2U,
        3U,
        &active,
        &candidate
    );
    commit_candidate_ready_metadata(
        &flash,
        BOOT_SLOT_A,
        2U,
        BOOT_SLOT_B,
        3U
    );

    simulated_flash_fail_before_program_address(
        &sim,
        STM32F429_BOOT_METADATA_B_BASE + TEST_METADATA_COMMIT_OFFSET
    );
    boot_slot_selection_options_t options = make_selection_options(
        &flash,
        &verify_context,
        image_buffer,
        NULL,
        NULL
    );
    expect_selection_status(
        "pending commit power loss falls back",
        BOOT_SLOT_SELECTION_OK,
        boot_slot_selection_select(&options, &selection)
    );
    expect_u32("power-loss fallback decision", BOOT_SLOT_SELECTION_DECISION_FALLBACK, selection.decision);
    expect_u32("power-loss fallback active", active->id, selection.selected_slot);
    expect_u32("power-loss fallback cause", BOOT_SLOT_SELECTION_ERR_COMMIT, selection.fallback_cause);
    expect_metadata_status(
        "recover after pending commit power loss",
        BOOT_METADATA_OK,
        boot_metadata_recover_from_flash(&flash, &recovered, NULL)
    );
    expect_metadata_record(
        "ready metadata survives pending commit failure",
        &recovered,
        3U,
        BOOT_METADATA_STATE_CANDIDATE_READY,
        BOOT_SLOT_A,
        BOOT_SLOT_B,
        3U
    );
    (void)candidate;
}

static void test_slot_selection_logical_failure_injection(void)
{
    {
        static simulated_flash_t sim;
        boot_flash_t flash;
        const boot_slot_descriptor_t *active = NULL;
        const boot_slot_descriptor_t *candidate = NULL;
        uint8_t image_buffer[TEST_PACKAGE_BUFFER_SIZE];
        selection_verify_context_t verify_context;
        boot_slot_selection_result_t selection;
        boot_metadata_record_t recovered;
        selection_fault_config_t fault = {
            BOOT_SLOT_SELECTION_FAULT_METADATA_PENDING_TRIAL,
            BOOT_METADATA_MAX_BOOT_ATTEMPTS - 1UL,
            1U
        };

        make_installer_flash(&sim, &flash);
        setup_selection_images(&sim, BOOT_SLOT_A, 2U, 3U, &active, &candidate);
        commit_candidate_ready_metadata(&flash, BOOT_SLOT_A, 2U, BOOT_SLOT_B, 3U);
        boot_slot_selection_options_t options = make_selection_options(
            &flash,
            &verify_context,
            image_buffer,
            selection_fault_hook,
            &fault
        );
        expect_selection_status(
            "pending transition injection falls back",
            BOOT_SLOT_SELECTION_OK,
            boot_slot_selection_select(&options, &selection)
        );
        expect_u32("pending injection fallback", BOOT_SLOT_SELECTION_DECISION_FALLBACK, selection.decision);
        expect_u32("pending injection cause", BOOT_SLOT_SELECTION_ERR_INJECTED, selection.fallback_cause);
        expect_metadata_status(
            "ready survives pending injection",
            BOOT_METADATA_OK,
            boot_metadata_recover_from_flash(&flash, &recovered, NULL)
        );
        expect_metadata_record(
            "ready after pending injection",
            &recovered,
            3U,
            BOOT_METADATA_STATE_CANDIDATE_READY,
            BOOT_SLOT_A,
            BOOT_SLOT_B,
            3U
        );
        (void)active;
        (void)candidate;
    }

    {
        static simulated_flash_t sim;
        boot_flash_t flash;
        const boot_slot_descriptor_t *active = NULL;
        const boot_slot_descriptor_t *candidate = NULL;
        uint8_t image_buffer[TEST_PACKAGE_BUFFER_SIZE];
        selection_verify_context_t verify_context;
        boot_slot_selection_result_t selection;
        boot_metadata_record_t recovered;
        selection_fault_config_t fault = {
            BOOT_SLOT_SELECTION_FAULT_METADATA_ATTEMPT_DECREMENT,
            1U,
            1U
        };

        make_installer_flash(&sim, &flash);
        setup_selection_images(&sim, BOOT_SLOT_A, 2U, 3U, &active, &candidate);
        commit_pending_metadata(&flash, BOOT_SLOT_A, 2U, BOOT_SLOT_B, 3U, 2U);
        boot_slot_selection_options_t options = make_selection_options(
            &flash,
            &verify_context,
            image_buffer,
            selection_fault_hook,
            &fault
        );
        expect_selection_status(
            "attempt decrement injection falls back",
            BOOT_SLOT_SELECTION_OK,
            boot_slot_selection_select(&options, &selection)
        );
        expect_u32("attempt injection fallback", BOOT_SLOT_SELECTION_DECISION_FALLBACK, selection.decision);
        expect_u32("attempt injection cause", BOOT_SLOT_SELECTION_ERR_INJECTED, selection.fallback_cause);
        expect_metadata_status(
            "pending survives attempt injection",
            BOOT_METADATA_OK,
            boot_metadata_recover_from_flash(&flash, &recovered, NULL)
        );
        expect_metadata_record(
            "pending after attempt injection",
            &recovered,
            4U,
            BOOT_METADATA_STATE_PENDING_TRIAL,
            BOOT_SLOT_A,
            BOOT_SLOT_B,
            3U
        );
        expect_u32("attempt count preserved", 2U, recovered.boot_attempt_count);
        (void)active;
        (void)candidate;
    }

    {
        static simulated_flash_t sim;
        boot_flash_t flash;
        const boot_slot_descriptor_t *active = NULL;
        const boot_slot_descriptor_t *candidate = NULL;
        uint8_t image_buffer[TEST_PACKAGE_BUFFER_SIZE];
        selection_verify_context_t verify_context;
        boot_slot_selection_result_t selection;
        selection_fault_config_t fault = {
            BOOT_SLOT_SELECTION_FAULT_VERIFY_CANDIDATE,
            BOOT_SLOT_B,
            1U
        };

        make_installer_flash(&sim, &flash);
        setup_selection_images(&sim, BOOT_SLOT_A, 2U, 3U, &active, &candidate);
        commit_candidate_ready_metadata(&flash, BOOT_SLOT_A, 2U, BOOT_SLOT_B, 3U);
        boot_slot_selection_options_t options = make_selection_options(
            &flash,
            &verify_context,
            image_buffer,
            selection_fault_hook,
            &fault
        );
        expect_selection_status(
            "candidate verification injection falls back",
            BOOT_SLOT_SELECTION_OK,
            boot_slot_selection_select(&options, &selection)
        );
        expect_u32("verify injection fallback", BOOT_SLOT_SELECTION_DECISION_FALLBACK, selection.decision);
        expect_u32("verify injection cause", BOOT_SLOT_SELECTION_ERR_INJECTED, selection.fallback_cause);
        (void)active;
        (void)candidate;
    }

    {
        simulated_flash_t sim;
        boot_flash_t flash;
        const boot_slot_descriptor_t *active = NULL;
        const boot_slot_descriptor_t *candidate = NULL;
        uint8_t image_buffer[TEST_PACKAGE_BUFFER_SIZE];
        selection_verify_context_t verify_context;
        boot_slot_selection_result_t selection;
        boot_metadata_record_t recovered;
        selection_fault_config_t fault = {
            BOOT_SLOT_SELECTION_FAULT_METADATA_REJECT_INVALID,
            BOOT_SLOT_SELECTION_RESULT_CANDIDATE_VERIFY_FAILED,
            1U
        };

        make_installer_flash(&sim, &flash);
        setup_selection_images(&sim, BOOT_SLOT_A, 2U, 3U, &active, &candidate);
        commit_candidate_ready_metadata(&flash, BOOT_SLOT_A, 2U, BOOT_SLOT_B, 3U);
        sim.storage[
            flash_offset(
                candidate->signed_image_base +
                SIGNED_IMAGE_HEADER_SIZE +
                APPLICATION_VECTOR_MIN_SIZE
            )
        ] ^= 0x01U;
        boot_slot_selection_options_t options = make_selection_options(
            &flash,
            &verify_context,
            image_buffer,
            selection_fault_hook,
            &fault
        );
        expect_selection_status(
            "reject-invalid injection still falls back",
            BOOT_SLOT_SELECTION_OK,
            boot_slot_selection_select(&options, &selection)
        );
        expect_u32("reject injection fallback", BOOT_SLOT_SELECTION_DECISION_FALLBACK, selection.decision);
        expect_u32("reject injection selected active", active->id, selection.selected_slot);
        expect_metadata_status(
            "ready survives reject injection",
            BOOT_METADATA_OK,
            boot_metadata_recover_from_flash(&flash, &recovered, NULL)
        );
        expect_metadata_record(
            "ready after reject injection",
            &recovered,
            3U,
            BOOT_METADATA_STATE_CANDIDATE_READY,
            BOOT_SLOT_A,
            BOOT_SLOT_B,
            3U
        );
    }
}

static void test_confirmation_rejects_wrong_slot_and_commit_failure(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    const boot_slot_descriptor_t *active = NULL;
    const boot_slot_descriptor_t *candidate = NULL;
    boot_confirm_result_t confirmation;
    boot_metadata_record_t recovered;

    make_installer_flash(&sim, &flash);
    setup_selection_images(
        &sim,
        BOOT_SLOT_A,
        2U,
        3U,
        &active,
        &candidate
    );
    commit_pending_metadata(
        &flash,
        BOOT_SLOT_A,
        2U,
        BOOT_SLOT_B,
        3U,
        BOOT_METADATA_MAX_BOOT_ATTEMPTS - 1UL
    );

