Zimbo88/stm32-security-lab/tests/update_storage/test_update_storage.c
    expect_confirm_status(
        "cannot confirm another slot",
        BOOT_CONFIRM_ERR_NOT_PENDING,
        boot_confirm_current_slot(&flash, BOOT_SLOT_A, &confirmation)
    );

    simulated_flash_fail_before_program_address(
        &sim,
        STM32F429_BOOT_METADATA_A_BASE + TEST_METADATA_COMMIT_OFFSET
    );
    expect_confirm_status(
        "confirmation commit failure reported",
        BOOT_CONFIRM_ERR_COMMIT,
        boot_confirm_current_slot(&flash, BOOT_SLOT_B, &confirmation)
    );
    expect_metadata_status(
        "recover pending after confirmation commit failure",
        BOOT_METADATA_OK,
        boot_metadata_recover_from_flash(&flash, &recovered, NULL)
    );
    expect_metadata_record(
        "pending survives confirmation commit failure",
        &recovered,
        4U,
        BOOT_METADATA_STATE_PENDING_TRIAL,
        BOOT_SLOT_A,
        BOOT_SLOT_B,
        3U
    );
    (void)active;
    (void)candidate;
}

int main(void)
{
    init_update_keys();

    test_sector_lookup_and_bounds();
    test_allowed_erase_policy();
    test_target_flash_stub_fails_closed();
    test_program_alignment_bounds_and_readback();
    test_read_rejects_address_overflow_before_backend();
    test_readback_verification_failure_is_reported();
    test_failure_injection_is_visible();
    test_flash_init_rejects_invalid_policy();
    test_metadata_encode_decode_and_recovery();
    test_metadata_rejects_noncanonical_records();
    test_metadata_identical_sequence_is_deterministic();
    test_metadata_ambiguous_and_sequence_handling();
    test_metadata_state_transitions();
    test_metadata_flash_commit_and_recovery();
    test_metadata_power_loss_during_copy_write_keeps_previous_copy();
    test_metadata_uncommitted_record_is_not_selected();
    test_metadata_commit_failure_boundaries_are_deterministic();
    test_update_package_parse_and_verify_security_cases();
    test_update_installer_success_to_candidate_ready();
    test_update_installer_uses_opposite_inactive_slot();
    test_update_installer_rejects_rollback_and_active_slot_package();
    test_update_installer_rejects_bad_metadata_states();
    test_update_installer_logical_failure_injection();
    test_update_installer_flash_failure_injection();
    test_update_installer_detects_post_program_corruption();
    test_update_installer_detects_final_hash_mismatch();
    test_update_installer_detects_verifier_failure_after_programming();

    test_slot_selection_successful_upgrade_and_confirmation();
    test_slot_selection_missing_confirmation_exhausts_attempts();
    test_slot_selection_invalid_candidate_falls_back();
    test_slot_selection_recovers_torn_metadata_copy();
    test_slot_selection_rejects_ambiguous_or_invalid_metadata();
    test_slot_selection_power_loss_before_attempt_commit_falls_back();
    test_slot_selection_logical_failure_injection();
    test_confirmation_rejects_wrong_slot_and_commit_failure();

    if (failures != 0) {
        printf("update storage tests failed: %d\n", failures);
        return 1;
    }

    printf("update storage tests passed\n");
    return 0;
}
